import React from "react";
import { Typography, Button } from "antd";
const { Title } = Typography;
import Tile from "../../Shared/Tile";

const steps = [
  {
    title: "Привлечение (CAC: 300₽)",
    steps: ["Реалити-шоу", "Органический трафик", "Сарафанное радио"],
  },
  {
    title: "Диагностика (2000₽)",
    steps: ["AI-анализ ситуации", "Разработка плана", "Базовые рекомендации"],
  },
  {
    title: "Консультация",
    steps: ["Детальный разбор плана", "Ответы на вопросы", "Выбор стратегии"],
  },
  {
    title: "Реализация",
    steps: ["Подбор специалистов", "Контроль качества", "Сопровождение"],
  },
];
const model = [
  {
    title: "Модель работы",
    steps: [
      "Оплата за лид (ср. чек 18.000₽)",
      "Квалификация через AI",
      "Гарантия качества",
      "Контроль конверсии",
    ],
  },
  {
    title: "Типы партнеров",
    steps: [
      "Банки и КПК",
      "Юридические компании",
      "Кредитные брокеры",
      "Финансовые консультанты",
    ],
  },
];

const financials = [
  {
    title: "Год 1",
    steps: ["B2C: 45.9 млн ₽", "B2B: 82.6 млн ₽", "Итого: 128.5 млн ₽"],
  },
  {
    title: "Год 2",
    steps: ["B2C: 268.7 млн ₽", "B2B: 621.9 млн ₽", "Итого: 890.6 млн ₽"],
  },
  {
    title: "Год 3",
    steps: ["B2C: 1.117 млрд ₽", "B2B: 3.017 млрд ₽", "Итого: 4.134 млрд ₽"],
  },
  {
    title: "Рост",
    steps: ["Год 1: 2.2% ", "Год 2: 48.5%", "Год 3: 69.8%"],
  },
  {
    title: "Доля рынка",
    steps: ["Год 1: 0,0097%", "Год 2: 0,067%", "Год 3: 0,311%"],
  },
];

export default function Five() {
  return (
    <div className="five">
      <div className="container five__content">
        <Title level={2}>Двойная монетизация: устойчивая модель роста</Title>
        <Title level={3}>Партнерская экосистема</Title>
        <Title level={3}>Финансовые показатели</Title>
        <div>Цель за 6 лет занять 10% доли рынка</div>
        <div>
          <Button>Написать основателю</Button>
        </div>
      </div>
    </div>
  );
}
